Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_irda.h
  IRDA_InitTypeDef            Init;             /*!<  IRDA communication parameters      */

  uint8_t                     *pTxBuffPtr;      /*!<  Pointer to IRDA Tx transfer Buffer */

  uint32_t                    TxXferSize;       /*!<  IRDA Tx Transfer size              */

  __IO uint32_t               TxXferCount;      /*!<  IRDA Tx Transfer Counter           */

  uint8_t                     *pRxBuffPtr;      /*!<  Pointer to IRDA Rx transfer Buffer */

  uint32_t                    RxXferSize;       /*!<  IRDA Rx Transfer size              */

  __IO uint32_t               RxXferCount;      /*!<  IRDA Rx Transfer Counter           */

  uint16_t                    Mask;             /*!< USART RX RDR register mask         */

  DMA_HandleTypeDef           *hdmatx;          /*!<  IRDA Tx DMA Handle parameters      */

  DMA_HandleTypeDef           *hdmarx;          /*!<  IRDA Rx DMA Handle parameters      */

  HAL_LockTypeDef             Lock;             /*!<  Locking object                     */

  __IO HAL_IRDA_StateTypeDef  gState;           /*!<  IRDA state information related to global Handle management
                                                   and also related to Tx operations.
                                                   This parameter can be a value of @ref HAL_IRDA_StateTypeDef */

  __IO HAL_IRDA_StateTypeDef  RxState;          /*!<  IRDA state information related to Rx operations.
                                                   This parameter can be a value of @ref HAL_IRDA_StateTypeDef */

  __IO uint32_t               ErrorCode;        /*!< IRDA Error code                    */

#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
  void (* TxBlockCpltCallback)(struct __IRDA_HandleTypeDef *hirda);       /*!< IRDA Tx Block Complete Callback       */
  void (* TxHalfBlockCpltCallback)(struct __IRDA_HandleTypeDef *hirda);   /*!< IRDA Tx Half Block Complete Callback  */
  void (* TxSrcCpltCallback)(struct __IRDA_HandleTypeDef *hirda);         /*!< IRDA Tx Source Complete Callback      */
  void (* TxCpltCallback)(struct __IRDA_HandleTypeDef *hirda);            /*!< IRDA Tx Complete Callback             */
  void (* RxBlockCpltCallback)(struct __IRDA_HandleTypeDef *hirda);       /*!< IRDA Rx Block Complete Callback       */
  void (* RxHalfBlockCpltCallback)(struct __IRDA_HandleTypeDef *hirda);   /*!< IRDA Rx Half Block Complete Callback  */
  void (* RxDstCpltCallback)(struct __IRDA_HandleTypeDef *hirda);         /*!< IRDA Rx Destination Complete Callback */
  void (* RxCpltCallback)(struct __IRDA_HandleTypeDef *hirda);            /*!< IRDA Rx Complete Callback             */
  void (* ErrorCallback)(struct __IRDA_HandleTypeDef *hirda);             /*!< IRDA Error Callback                   */
  void (* AbortCpltCallback)(struct __IRDA_HandleTypeDef *hirda);         /*!< IRDA Abort Complete Callback          */
  void (* AbortTransmitCpltCallback)(struct __IRDA_HandleTypeDef *hirda); /*!< IRDA Abort Transmit Complete Callback */
  void (* AbortReceiveCpltCallback)(struct __IRDA_HandleTypeDef *hirda);  /*!< IRDA Abort Receive Complete Callback  */

  void (* MspInitCallback)(struct __IRDA_HandleTypeDef *hirda);           /*!< IRDA Msp Init callback                */
  void (* MspDeInitCallback)(struct __IRDA_HandleTypeDef *hirda);         /*!< IRDA Msp DeInit callback              */
#endif  /* USE_HAL_IRDA_REGISTER_CALLBACKS */

} IRDA_HandleTypeDef;

#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL IRDA Callback ID enumeration definition
  */
typedef enum
{
  HAL_IRDA_TX_BLOCKCOMPLETE_CB_ID        = 0x00U,    /*!< IRDA Tx Block Complete Callback ID       */
  HAL_IRDA_TX_HALFBLOCKCOMPLETE_CB_ID    = 0x01U,    /*!< IRDA Tx Half Block Complete Callback ID  */
  HAL_IRDA_TX_SRCCOMPLETE_CB_ID          = 0x02U,    /*!< IRDA Tx Source Complete Callback ID      */
  HAL_IRDA_TX_COMPLETE_CB_ID             = 0x03U,    /*!< IRDA Tx Complete Callback ID             */
  HAL_IRDA_RX_BLOCKCOMPLETE_CB_ID        = 0x04U,    /*!< IRDA Rx Block Complete Callback ID       */
  HAL_IRDA_RX_HALFBLOCKCOMPLETE_CB_ID    = 0x05U,    /*!< IRDA Rx Half Block Complete Callback ID  */
  HAL_IRDA_RX_DSTCOMPLETE_CB_ID          = 0x06U,    /*!< IRDA Rx Destination Complete Callback ID */
  HAL_IRDA_RX_COMPLETE_CB_ID             = 0x07U,    /*!< IRDA Rx Complete Callback ID             */
  HAL_IRDA_ERROR_CB_ID                   = 0x08U,    /*!< IRDA Error Callback ID                   */
  HAL_IRDA_ABORT_COMPLETE_CB_ID          = 0x09U,    /*!< IRDA Abort Complete Callback ID          */
  HAL_IRDA_ABORT_TRANSMIT_COMPLETE_CB_ID = 0x0AU,    /*!< IRDA Abort Transmit Complete Callback ID */
  HAL_IRDA_ABORT_RECEIVE_COMPLETE_CB_ID  = 0x0BU,    /*!< IRDA Abort Receive Complete Callback ID  */

  HAL_IRDA_MSPINIT_CB_ID                 = 0x0CU,    /*!< IRDA MspInit callback ID                 */
  HAL_IRDA_MSPDEINIT_CB_ID               = 0x0DU     /*!< IRDA MspDeInit callback ID               */

} HAL_IRDA_CallbackIDTypeDef;

/**
  * @brief  HAL IRDA Callback pointer definition
  */
typedef  void (*pIRDA_CallbackTypeDef)(IRDA_HandleTypeDef *hirda);  /*!< pointer to an IRDA callback function */

#endif /* USE_HAL_IRDA_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup IRDA_Exported_Constants IRDA Exported constants
  * @{
  */
  
/** @defgroup IRDA_Error_Code IRDA Error Code
  * @{
  */
#define HAL_IRDA_ERROR_NONE        0x00000000U   /*!< No error            */
#define HAL_IRDA_ERROR_PE          0x00000001U   /*!< Parity error        */
#define HAL_IRDA_ERROR_NE          0x00000002U   /*!< Noise error         */
#define HAL_IRDA_ERROR_FE          0x00000004U   /*!< Frame error         */
#define HAL_IRDA_ERROR_ORE         0x00000008U   /*!< Overrun error       */
#define HAL_IRDA_ERROR_DMA         0x00000010U   /*!< DMA transfer error  */
#define HAL_IRDA_ERROR_BUSY        0x00000020U   /*!< Busy Error          */
#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
#define HAL_IRDA_ERROR_INVALID_CALLBACK   ((uint32_t)0x00000040U)   /*!< Invalid Callback error  */
#endif /* USE_HAL_IRDA_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup IRDA_Word_Length IRDA Word Length
  * @{
  */
#define IRDA_WORDLENGTH_7B         USART_CR1_M1   /*!< 7-bit long frame */
#define IRDA_WORDLENGTH_8B         0x00000000U    /*!< 8-bit long frame */
#define IRDA_WORDLENGTH_9B         USART_CR1_M0   /*!< 9-bit long frame */
/**
  * @}
  */

/** @defgroup IRDA_Parity  IRDA Parity
  * @{
  */
#define IRDA_PARITY_NONE                    0x00000000U                      /*!< No parity   */
#define IRDA_PARITY_EVEN                    USART_CR1_PCE                    /*!< Even parity */
#define IRDA_PARITY_ODD                     (USART_CR1_PCE | USART_CR1_PS)   /*!< Odd parity  */
/**
  * @}
  */

